%% IAU2009_const IAU2009 天文常数
global IAU2009;
% IAU2009.c=2.99792458e8;%m/s光速
% IAU2009.AU=1.49597870700e11;% m地日距，天文单位距离
% IAU2009.mus=1.32712440041e20; % m^3*s^-2 地球引力常数
% IAU2009.ae=6378136.6;%m 地球半径
% IAU2009.G=6.67428e-11;% m^3*kg^-1*s^-2 万有引力常数
% IAU2009.mue=3.986004356e14; % m^3*s^-2 地球引力常数

IAU2009.c=2.99792458e8;%m/s光速
IAU2009.AU=1.49597870700e11;% m地日距，天文单位距离
IAU2009.mus=1.32712440041e20; % m^3*s^-2 太阳引力常数
IAU2009.ae=6378136.6;%m 地球半径
IAU2009.G=6.67428e-11;% m^3*kg^-1*s^-2 万有引力常数
IAU2009.mue=3.986004356e14; % m^3*s^-2 地球引力常数
%% 附加
% IAU2009.DU=IAU2009.ae;
IAU2009.TUe=sqrt(IAU2009.ae^3/IAU2009.mue);
IAU2009.TUs=sqrt(IAU2009.AU^3/IAU2009.mus);